Blasius_GitHub/flat_plate_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3120;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3160;
    }
    leftSide
    {
        type            patch;
        nFaces          40;
        startFace       3200;
    }
    rightSide
    {
        type            patch;
        nFaces          40;
        startFace       3240;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
